// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так - виведіть повідомлення 'Вірно' у alert().
//    Якщо ні - виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().





// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"


// const min = Math.floor(Math.random() * (59 - 0) + 0);

// function showQwarter(min) {
//     let quarter;

//     if (min < 15) {
//         alert ``
//     }
// }


// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.


function showSeason() {
    const num = prompt('Напиши число від 1 до 4');
    switch (num) {
        case "1":
            alert("Зима");
            break;
        case "2":
            alert("Весна");
            break;
        case "3":
            alert("Літо");
            break;
        case "4":
            alert("Осінь");
            break;
        default:
            alert("Не валідне число")
            break;
    }
}

showSeason();


// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples


// function showTime() {
//     const time = prompt("Введіть час");
//     const timeCorrect = `${time.padStart(2, "0")} хв`;
//     if (time < 59) {
//         alert (timeCorrect);
//     } else {
//         const timeCorrect = `${time.padStart(2, "0")}:${time.padStart(2, "0")} год`;
//         alert (timeCorrect);
//     }
// }

// розділить час можна спробувать через % або методом masFloor

// showTime();


// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"


function LogIn() {
    const userName = prompt("Введіть логін");
    if (userName === "Адмін") {
        const userPassword = prompt("Введіть пароль");
        if (userPassword === "Я головний") {
            alert("Добрий день!");
        } else {
            alert("Невірний пароль!")
        }
    } else if (!userName) {
        alert("Скасовано");
    } else {
        alert("Я вас не знаю")
    }
}

LogIn();


// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.




function getNumbers(min, max) {
    let total = 0;
    let count = 0;
    for (let i = max; i >= min; i--) {
        if (i % 2 === 0) {
            total += i;
            count++;
        }
        console.log(i);
    }
    return total;
}

console.log (getNumbers(40, 60));


// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

function showLowerNumber(a, b) {
    if (typeof a === "number" && typeof b === "number") {
        if (a < b) {
            return a;
        } else {
            return b;
        }
    } else {
        return 'Not a number!'
     }
}

console.log(showLowerNumber(6, 4));

